The  AssetSetIterator  type exposes the following members.
 Properties
Name  |   Description
Current
IsReadOnly
 Identifies if the object is read-only or modifiable.
 (Inherited from  APIObject  .)
 See Also
  AssetSetIterator Class
  Autodesk.Revit.DB.Visual Namespace